In [1]:
import pandas as pd

In [6]:
# Series are like lists

a = pd.Series(['John', 'Rick', 'Mike', 'Jane', 'Jill'])
print(a)

print(a[0])

print(a[1:4]) # slice

print(a[[0, 1, 3]]) #select more than one element with double bracket notation 

# boolean indexing
param = a != 'John' 
print(a[param])

0    John
1    Rick
2    Mike
3    Jane
4    Jill
dtype: object
John
1    Rick
2    Mike
3    Jane
dtype: object
0    John
1    Rick
3    Jane
dtype: object
1    Rick
2    Mike
3    Jane
4    Jill
dtype: object

In [7]:
# Convert dictionary to series
d = {'New York': 1300, 'Chicago': 900, 'San Francisco': 1100, 'Austin': 450}

cities = pd.Series(d)
print(cities)

New York         1300
Chicago           900
San Francisco    1100
Austin            450
dtype: int64

In [9]:
cities[['Chicago', 'San Francisco']]

Chicago           900
San Francisco    1100
dtype: int64

In [10]:
# boolean indexing
cities[cities < 1000]

Chicago    900
Austin     450
dtype: int64

In [11]:
# boolean indexing to change values
cities[cities < 1000] = 750
print(cities)

New York         1300
Chicago           750
San Francisco    1100
Austin            750
dtype: int64

In [13]:
# Dataframes are like spreadsheets
# Read CSV
titanic = pd.read_csv('titanic.txt', sep='\t')
print(titanic.head()) # print first 5 rows

  pclass    age   sex survived
0    1st  adult  male      yes
1    1st  adult  male      yes
2    1st  adult  male      yes
3    1st  adult  male      yes
4    1st  adult  male      yes

In [14]:
# Each column of a dataframe is essentially a series
titanic['age']

0       adult
1       adult
2       adult
3       adult
4       adult
        ...
2196    adult
2197    adult
2198    adult
2199    adult
2200    adult
Name: age, Length: 2201, dtype: object

In [15]:
# select multiple columns - output is a dataframe
titanic[['age', 'pclass']]

        age pclass
0     adult    1st
1     adult    1st
2     adult    1st
3     adult    1st
4     adult    1st
...     ...    ...
2196  adult   crew
2197  adult   crew
2198  adult   crew
2199  adult   crew
2200  adult   crew

[2201 rows x 2 columns]

In [16]:
titanic[(titanic.age=='child') & (titanic.pclass=='2nd')]

    pclass    age     sex survived
586    2nd  child    male      yes
587    2nd  child    male      yes
588    2nd  child    male      yes
589    2nd  child    male      yes
590    2nd  child    male      yes
591    2nd  child    male      yes
592    2nd  child    male      yes
593    2nd  child    male      yes
594    2nd  child    male      yes
595    2nd  child    male      yes
596    2nd  child    male      yes
597    2nd  child  female      yes
598    2nd  child  female      yes
599    2nd  child  female      yes
600    2nd  child  female      yes
601    2nd  child  female      yes
602    2nd  child  female      yes
603    2nd  child  female      yes
604    2nd  child  female      yes
605    2nd  child  female      yes
606    2nd  child  female      yes
607    2nd  child  female      yes
608    2nd  child  female      yes
609    2nd  child  female      yes

In [17]:
titanic[320:330] # Remember end index is exclusive

    pclass    age     sex survived
320    1st  child    male      yes
321    1st  child    male      yes
322    1st  child    male      yes
323    1st  child    male      yes
324    1st  child  female      yes
325    2nd  adult    male      yes
326    2nd  adult    male      yes
327    2nd  adult    male      yes
328    2nd  adult    male      yes
329    2nd  adult    male      yes

In [18]:
#Dataframe groupings and aggragates
by_age = titanic.groupby('age')

by_age.size()

age
adult    2092
child     109
dtype: int64

In [20]:
print(titanic.groupby(['sex']).size())

print(titanic.groupby(['survived', 'sex']).size())

sex
female     470
male      1731
dtype: int64
survived  sex
no        female     126
          male      1364
yes       female     344
          male       367
dtype: int64